Dataset/data_test/exp-7-8-9/swarm-hr-wrk-mixed-c6525-25g-exp7-havail0-hori1-verti1-infi0-client1-t8-c512-d30-R6000-N1
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=6000
Running 30s test @ http://10.10.1.6:5000
  8 threads and 512 connections
  Thread calibration: mean lat.: 2.391ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.435ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.415ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.411ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.396ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.431ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.363ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.392ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.67ms    3.95ms   9.14ms   96.91%
    Req/Sec   794.64    298.65     1.55k    67.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.86ms
 75.000%    3.21ms
 90.000%    4.73ms
 99.000%    9.14ms
 99.900%   58.97ms
 99.990%  101.69ms
 99.999%  130.56ms
100.000%  135.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.350     0.000000            1         1.00
       0.832     0.100000        12064         1.11
       1.088     0.200000        24050         1.25
       1.373     0.300000        36066         1.43
       1.600     0.400000        48084         1.67
       1.858     0.500000        60114         2.00
       2.063     0.550000        66133         2.22
       2.323     0.600000        72144         2.50
       2.597     0.650000        78149         2.86
       2.885     0.700000        84137         3.33
       3.215     0.750000        90155         4.00
       3.397     0.775000        93168         4.44
       3.591     0.800000        96170         5.00
       3.813     0.825000        99178         5.71
       4.067     0.850000       102170         6.67
       4.371     0.875000       105171         8.00
       4.535     0.887500       106684         8.89
       4.727     0.900000       108182        10.00
       4.939     0.912500       109681        11.43
       5.191     0.925000       111199        13.33
       5.495     0.937500       112691        16.00
       5.663     0.943750       113447        17.78
       5.851     0.950000       114190        20.00
       6.055     0.956250       114947        22.86
       6.295     0.962500       115692        26.67
       6.599     0.968750       116442        32.00
       6.783     0.971875       116816        35.56
       6.963     0.975000       117194        40.00
       7.195     0.978125       117570        45.71
       7.467     0.981250       117945        53.33
       7.827     0.984375       118322        64.00
       8.075     0.985938       118509        71.11
       8.359     0.987500       118700        80.00
       8.799     0.989062       118882        91.43
       9.567     0.990625       119069       106.67
      11.999     0.992188       119256       128.00
      15.679     0.992969       119350       142.22
      19.743     0.993750       119445       160.00
      24.271     0.994531       119539       182.86
      28.223     0.995313       119632       213.33
      33.919     0.996094       119726       256.00
      37.567     0.996484       119773       284.44
      40.511     0.996875       119820       320.00
      43.423     0.997266       119867       365.71
      46.783     0.997656       119914       426.67
      50.431     0.998047       119961       512.00
      51.871     0.998242       119984       568.89
      53.151     0.998437       120008       640.00
      54.719     0.998633       120031       731.43
      57.023     0.998828       120055       853.33
      59.295     0.999023       120078      1024.00
      61.151     0.999121       120091      1137.78
      62.879     0.999219       120102      1280.00
      63.967     0.999316       120113      1462.86
      69.183     0.999414       120125      1706.67
      73.919     0.999512       120137      2048.00
      74.943     0.999561       120143      2275.56
      76.415     0.999609       120149      2560.00
      78.719     0.999658       120154      2925.71
      82.239     0.999707       120160      3413.33
      85.247     0.999756       120166      4096.00
      87.039     0.999780       120169      4551.11
      89.023     0.999805       120172      5120.00
      91.903     0.999829       120175      5851.43
      93.887     0.999854       120178      6826.67
      97.919     0.999878       120181      8192.00
      99.967     0.999890       120182      9102.22
     105.727     0.999902       120184     10240.00
     106.431     0.999915       120185     11702.86
     109.951     0.999927       120187     13653.33
     110.207     0.999939       120188     16384.00
     111.807     0.999945       120189     18204.44
     112.063     0.999951       120190     20480.00
     112.063     0.999957       120190     23405.71
     116.543     0.999963       120191     27306.67
     119.807     0.999969       120192     32768.00
     119.807     0.999973       120192     36408.89
     121.151     0.999976       120193     40960.00
     121.151     0.999979       120193     46811.43
     121.151     0.999982       120193     54613.33
     130.559     0.999985       120194     65536.00
     130.559     0.999986       120194     72817.78
     130.559     0.999988       120194     81920.00
     130.559     0.999989       120194     93622.86
     130.559     0.999991       120194    109226.67
     135.423     0.999992       120195    131072.00
     135.423     1.000000       120195          inf
#[Mean    =        2.666, StdDeviation   =        3.950]
#[Max     =      135.296, Total count    =       120195]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  179394 requests in 30.00s, 74.15MB read
Requests/sec:   5979.43
Transfer/sec:      2.47MB