Dataset/data_test/exp-7-8-9/swarm-mm-wrk-compose-c6525-25g-exp9-havail0-hori1-verti1-infi0-client1-t8-c512-d30-R1000-N1
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=1000
Running 30s test @ http://10.10.1.6:8080/wrk2-api/user-timeline/read
  8 threads and 512 connections
  Thread calibration: mean lat.: 3.233ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.039ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.105ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.184ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.166ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.176ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.137ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.395ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.92ms    1.12ms   4.26ms   98.81%
    Req/Sec   131.82    119.87   454.00     56.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.80ms
 75.000%    2.99ms
 90.000%    3.20ms
 99.000%    4.26ms
 99.900%   20.82ms
 99.990%   32.65ms
 99.999%   33.89ms
100.000%   33.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.205     0.000000            1         1.00
       2.523     0.100000         2003         1.11
       2.611     0.200000         4006         1.25
       2.679     0.300000         6048         1.43
       2.739     0.400000         7992         1.67
       2.801     0.500000        10013         2.00
       2.833     0.550000        11018         2.22
       2.869     0.600000        12021         2.50
       2.905     0.650000        13033         2.86
       2.947     0.700000        14001         3.33
       2.991     0.750000        14973         4.00
       3.017     0.775000        15489         4.44
       3.045     0.800000        15984         5.00
       3.079     0.825000        16496         5.71
       3.115     0.850000        16991         6.67
       3.155     0.875000        17493         8.00
       3.177     0.887500        17734         8.89
       3.203     0.900000        17967        10.00
       3.239     0.912500        18224        11.43
       3.277     0.925000        18469        13.33
       3.323     0.937500        18717        16.00
       3.351     0.943750        18842        17.78
       3.381     0.950000        18965        20.00
       3.423     0.956250        19094        22.86
       3.465     0.962500        19215        26.67
       3.519     0.968750        19341        32.00
       3.559     0.971875        19402        35.56
       3.601     0.975000        19465        40.00
       3.669     0.978125        19529        45.71
       3.733     0.981250        19591        53.33
       3.821     0.984375        19654        64.00
       3.885     0.985938        19684        71.11
       3.995     0.987500        19714        80.00
       4.155     0.989062        19747        91.43
       4.315     0.990625        19776       106.67
       4.839     0.992188        19808       128.00
       5.203     0.992969        19823       142.22
       5.515     0.993750        19839       160.00
       6.055     0.994531        19854       182.86
       8.263     0.995313        19870       213.33
      10.639     0.996094        19886       256.00
      12.863     0.996484        19893       284.44
      14.703     0.996875        19901       320.00
      15.223     0.997266        19909       365.71
      16.039     0.997656        19917       426.67
      17.455     0.998047        19925       512.00
      18.159     0.998242        19928       568.89
      18.863     0.998437        19932       640.00
      19.551     0.998633        19936       731.43
      20.399     0.998828        19941       853.33
      21.087     0.999023        19944      1024.00
      21.743     0.999121        19946      1137.78
      22.719     0.999219        19948      1280.00
      23.103     0.999316        19950      1462.86
      25.295     0.999414        19952      1706.67
      27.279     0.999512        19954      2048.00
      27.423     0.999561        19955      2275.56
      28.463     0.999609        19956      2560.00
      29.919     0.999658        19957      2925.71
      30.207     0.999707        19958      3413.33
      30.863     0.999756        19959      4096.00
      30.863     0.999780        19959      4551.11
      32.111     0.999805        19960      5120.00
      32.111     0.999829        19960      5851.43
      32.655     0.999854        19961      6826.67
      32.655     0.999878        19961      8192.00
      32.655     0.999890        19961      9102.22
      32.895     0.999902        19962     10240.00
      32.895     0.999915        19962     11702.86
      32.895     0.999927        19962     13653.33
      32.895     0.999939        19962     16384.00
      32.895     0.999945        19962     18204.44
      33.887     0.999951        19963     20480.00
      33.887     1.000000        19963          inf
#[Mean    =        2.916, StdDeviation   =        1.123]
#[Max     =       33.856, Total count    =        19963]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29787 requests in 30.01s, 5.23MB read
  Socket errors: connect 0, read 0, write 0, timeout 152
Requests/sec:    992.57
Transfer/sec:    178.35KB